HI @myc2h6o 

I have tried the code you send but it still didnt work.  Any other ideas? :(
```
# module.env-definition.module.identity_operator_nodepool_rbac.azurerm_role_assignment.role_assignment must be replaced
-/+ resource "azurerm_role_assignment" "role_assignment" {
      ~ id                               = "xxxx" -> (known after apply)
      ~ name                             = "xxx-xxx-xxx-xxx-xxx" -> (known after apply)
      ~ principal_id                     = "xxx-xxx-xxx-xxx-xxxxxx" -> (known after apply) # forces replacement
      ~ principal_type                   = "ServicePrincipal" -> (known after apply)
      ~ role_definition_id               = "/subscriptions/xxxxx-xxxxx-xxxx-xxxxx-xxxxx/providers/Microsoft.Authorization/roleDefinitions/xxxx-xxxxx-xxxxx-xxxxxx" -> (known after apply)
      ~ scope                            = "/subscriptions/xxxx/resourceGroups/MC_rg-xxxx-dev-weeu_aks-xxxx-xxx-weeu_westeurope" -> (known after apply) # forces replacement
      + skip_service_principal_aad_check = (known after apply)
        # (2 unchanged attributes hidden)
    }

```

